tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "jtyr/repo"
tap "mczachurski/wallpapper"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Parse HTML at the command-line
brew "pup"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Powerful free data recovery utility
brew "testdisk"
# Programatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Manage the desktop wallpaper
brew "wallpaper"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "ableton-live-suite"
cask "adobe-creative-cloud"
cask "aerial"
cask "airfoil"
cask "alfred"
cask "bartender"
cask "beamer"
cask "behringer-x32-edit"
cask "daisydisk"
cask "docker"
cask "firefox"
cask "franz"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "jumpshare"
cask "little-snitch"
cask "paste"
cask "rescuetime"
cask "screaming-frog-seo-spider"
cask "skype"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "telegram"
cask "transmit"
cask "tripmode"
cask "visual-studio-code"
cask "vox"
cask "wireshark"
mas "Compressor", id: 424390742
mas "Dynaper", id: 1435296403
mas "Final Cut Pro", id: 424389933
mas "Frame.io", id: 992958444
mas "HueParty", id: 792963035
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro X", id: 634148309
mas "Magnet", id: 441258766
mas "MainStage 3", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Theine", id: 955848755
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
